# FSActLayer

## Description
Function FSActLayer returns a handle to the first selected object on the active layer. If no objects are selected, the function returns NIL.

```pascal
FUNCTION FSActLayer : HANDLE;
```

```python
def vs.FSActLayer():
    return HANDLE
```

## See Also
Relative calls:
* NextObj | PrevObj
* FObject | LObject
* FSActLayer | LSActLayer
* FSObject  | LActLayer
* NextDObj | PrevDObj
* NextSObj | PrevSObj

## Version
Availability: from All Versions

## Category
* Document List Handling